Waiting for switch to be up
enabling ports: ['9/0', '10/0', '11/0', '12/0', '13/0', '14/0', '15/0', '16/0', '17/0', '18/0', '19/0', '20/0', '21/0', '22/0', '23/0', '24/0'] (dev ids: [60, 52, 44, 36, 28, 20, 12, 4, 0, 8, 16, 24, 32, 40, 48, 56]) at rate: 100G
port: 60
port: 52
port: 44
port: 36
port: 28
port: 20
port: 12
port: 4
port: 0
port: 8
port: 16
port: 24
port: 32
port: 40
port: 48
port: 56
=== add_entries via bfshell ===
('Command:', '/home/leoyu/bf-sde-9.2.0/install/bin/bfshell -f mac_learning_ut_hw_output_rules.txt')

pd-mac-learning-ut-hw
pd tiFilter add_entry aiFilter_pfuzz_tiFilter ig_intr_md_ingress_port 40 ig_intr_md_for_tm_ucast_egress_port 40
pd tiFilter add_entry aiFilter_pfuzz_tiFilter ig_intr_md_ingress_port 44 ig_intr_md_for_tm_ucast_egress_port 44
pd tiFilter add_entry aiFilter_pfuzz_tiFilter ig_intr_md_ingress_port 48 ig_intr_md_for_tm_ucast_egress_port 48
pd tiFilter add_entry aiFilter_pfuzz_tiFilter ig_intr_md_ingress_port 52 ig_intr_md_for_tm_ucast_egress_port 52
pd tiFilter add_entry aiFilter_pfuzz_tiFilter ig_intr_md_ingress_port 56 ig_intr_md_for_tm_ucast_egress_port 56
pd tiFilter add_entry aiFilter_pfuzz_tiFilter ig_intr_md_ingress_port 60 ig_intr_md_for_tm_ucast_egress_port 60
end
exit

        ********************************************
        *      WARNING: Authorised Access Only     *
        ********************************************
    
bfshell> 
bfshell> pd-mac-learning-ut-hw
pd-mac-learning-ut-hw:0> pd tiFilter add_entry aiFilter_pfuzz_tiFilter ig_intr_mEd_ingress_port 40 ig_intr_md_for_tm_ucast_egress_port 40
entry_hdl: 2 (0x2)
pd-mac-learning-ut-hw:0> pd tiFilter add_entry aiFilter_pfuzz_tiFilter ig_intr_mEd_ingress_port 44 ig_intr_md_for_tm_ucast_egress_port 44
entry_hdl: 3 (0x3)
pd-mac-learning-ut-hw:0> pd tiFilter add_entry aiFilter_pfuzz_tiFilter ig_intr_mEd_ingress_port 48 ig_intr_md_for_tm_ucast_egress_port 48
entry_hdl: 4 (0x4)
pd-mac-learning-ut-hw:0> pd tiFilter add_entry aiFilter_pfuzz_tiFilter ig_intr_mEd_ingress_port 52 ig_intr_md_for_tm_ucast_egress_port 52
entry_hdl: 5 (0x5)
pd-mac-learning-ut-hw:0> pd tiFilter add_entry aiFilter_pfuzz_tiFilter ig_intr_mEd_ingress_port 56 ig_intr_md_for_tm_ucast_egress_port 56
entry_hdl: 6 (0x6)
pd-mac-learning-ut-hw:0> pd tiFilter add_entry aiFilter_pfuzz_tiFilter ig_intr_mEd_ingress_port 60 ig_intr_md_for_tm_ucast_egress_port 60
entry_hdl: 7 (0x7)
pd-mac-learning-ut-hw:0> end
bfshell> exit

None
=== run_dynamic ===
=== add_entries via bfshell ===
('Command:', '/home/leoyu/bf-sde-9.2.0/install/bin/bfshell -f mac_learning_ut_hw_output_rules.txt')

pd-mac-learning-ut-hw
pd tiLearnMAC add_entry aiNoOp_pfuzz_tiLearnMAC ethernet_srcAddr 0x000000000000
pd tiForward add_entry aiForward_pfuzz_tiForward ethernet_dstAddr 0x000000000000 action_egress_port 0
end
exit

        ********************************************
        *      WARNING: Authorised Access Only     *
        ********************************************
    
bfshell> 
bfshell> pd-mac-learning-ut-hw
pd-mac-learning-ut-hw:0> pd tiLearnMAC add_entry aiNoOp_pfuzz_tiLearnMAC etherneEt_srcAddr 0x000000000000
entry_hdl: 2 (0x2)
pd-mac-learning-ut-hw:0> pd tiForward add_entry aiForward_pfuzz_tiForward ethernEet_dstAddr 0x000000000000 action_egress_port 0
entry_hdl: 2 (0x2)
pd-mac-learning-ut-hw:0> end
bfshell> exit

None
============
--- receive_packet ---
--- packet received of size: 90 ---
33 33 00 00 00 16 00 02 00 00 03 00 86 dd 60 00 00 00 00 24 00 01 fe 80 00 00 00 00 00 00 02 02 00 ff fe 00 03 00 ff 02 00 00 00 00 00 00 00 00 00 00 00 00 00 16 3a 00 05 02 00 00 01 00 8f 00 6a 07 00 00 00 01 04 00 00 00 ff 02 00 00 00 00 00 00 00 00 00 01 ff 00 03 00
--- parsePacket ---
--- src_mac: 00:00:00:24:00:01 ---
--- Install ruleList len: 2 ---
['pd tiLearnMAC add_entry aiNoOp_pfuzz_tiLearnMAC ethernet_srcAddr 0x000000240001', 'pd tiForward add_entry aiForward_pfuzz_tiForward ethernet_dstAddr 0x000000240001 action_egress_port 0']
--- Sanitized ruleList len: 2 ---
=== add_entries via bfshell ===
('Command:', '/home/leoyu/bf-sde-9.2.0/install/bin/bfshell -f mac_learning_ut_hw_output_rules.txt')

pd-mac-learning-ut-hw
pd tiLearnMAC add_entry aiNoOp_pfuzz_tiLearnMAC ethernet_srcAddr 0x000000240001
pd tiForward add_entry aiForward_pfuzz_tiForward ethernet_dstAddr 0x000000240001 action_egress_port 0
end
exit

        ********************************************
        *      WARNING: Authorised Access Only     *
        ********************************************
    
bfshell> 
bfshell> pd-mac-learning-ut-hw
pd-mac-learning-ut-hw:0> pd tiLearnMAC add_entry aiNoOp_pfuzz_tiLearnMAC etherneEt_srcAddr 0x000000240001
entry_hdl: 3 (0x3)
pd-mac-learning-ut-hw:0> pd tiForward add_entry aiForward_pfuzz_tiForward ethernEet_dstAddr 0x000000240001 action_egress_port 0
entry_hdl: 3 (0x3)
pd-mac-learning-ut-hw:0> end
bfshell> exit

None
============
--- receive_packet ---
No packet within timeout
============
--- receive_packet ---
No packet within timeout
============
--- receive_packet ---
No packet within timeout
============
--- receive_packet ---
No packet within timeout
============
--- receive_packet ---
No packet within timeout
============
--- receive_packet ---
No packet within timeout
============
--- receive_packet ---
No packet within timeout
============
--- receive_packet ---
No packet within timeout
============
--- receive_packet ---
No packet within timeout
============
--- receive_packet ---
No packet within timeout
============
--- receive_packet ---
No packet within timeout
============
--- receive_packet ---
No packet within timeout
============
--- receive_packet ---
No packet within timeout
============
--- receive_packet ---
No packet within timeout
============
--- receive_packet ---
No packet within timeout
============
--- receive_packet ---
No packet within timeout
============
--- receive_packet ---
No packet within timeout
============
--- receive_packet ---
No packet within timeout
============
--- receive_packet ---
No packet within timeout
============
--- receive_packet ---
No packet within timeout
============
--- receive_packet ---
No packet within timeout
============
--- receive_packet ---
No packet within timeout
============
--- receive_packet ---
No packet within timeout
============
--- receive_packet ---
No packet within timeout
============
--- receive_packet ---
No packet within timeout
============
--- receive_packet ---
No packet within timeout
============
--- receive_packet ---
No packet within timeout
============
--- receive_packet ---
No packet within timeout
============
--- receive_packet ---
No packet within timeout
============
--- receive_packet ---
No packet within timeout
============
--- receive_packet ---
No packet within timeout
============
--- receive_packet ---
No packet within timeout
============
--- receive_packet ---
No packet within timeout
============
--- receive_packet ---
No packet within timeout
============
--- receive_packet ---
No packet within timeout
============
--- receive_packet ---
No packet within timeout
============
--- receive_packet ---
No packet within timeout
============
--- receive_packet ---
No packet within timeout
============
--- receive_packet ---
No packet within timeout
============
--- receive_packet ---
No packet within timeout
============
--- receive_packet ---
No packet within timeout
============
--- receive_packet ---
No packet within timeout
============
--- receive_packet ---
No packet within timeout
============
--- receive_packet ---
No packet within timeout
============
--- receive_packet ---
No packet within timeout
============
--- receive_packet ---
No packet within timeout
============
--- receive_packet ---
No packet within timeout
============
--- receive_packet ---
No packet within timeout
============
--- receive_packet ---
No packet within timeout
============
--- receive_packet ---
No packet within timeout
============
--- receive_packet ---
No packet within timeout
============
--- receive_packet ---
No packet within timeout
============
--- receive_packet ---
No packet within timeout
============
